scripts/artillery.yaml
config:
  target: 'http://localhost:4000' # 소켓 서버 주소
  processor: './generateUUID.js' # UUID 생성 스크립트
  phases:
    - duration: 60 # 테스트 지속 시간 (초)
      arrivalRate: 100 # 초당 새로운 가상 유저 생성 수
  ws:
    true
    # WebSocket 연결 설정 (필요시)
scenarios:
  - flow:
      - get:
          url: "/"
scenarios:
  - engine: 'socketio' # Socket.io 사용
    flow:
      - function: 'generateUUID'
      - emit: # 방 참여
          channel: 'joinRoom'
          data:
            uuid: '{{ uuid }}'
            nickname: 'test'
            img: 'test.jpg'
      - think: 3 # 1초 대기
      - emit: # 메시지 전송
          channel: 'msgToServer'
          data:
            uuid: '{{ uuid }}'
            message: 'Hello, World!'
            nickname: 'test'
            img: 'test.jpg'
      - think: 1 # 1초 대기
      # - emit: # 방 나가기
      #     channel: 'removeRoom'
      #     data:
      #       uuid: '{{ uuid }}'